In [9]:
import pandas as pd
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35, 60000], ['Marry', 29, 58000]]
#print(dir(pd.DataFrame))
df = pd.DataFrame(data = data, columns = ["Name","Age","Salary"])

In [11]:
df["Name"][0]

'Dan'

In [13]:
type(df.Name)

pandas.core.series.Series

In [15]:
df.loc[0]

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [16]:
df.loc[[0,2,3]]

    Name  Age  Salary
0    Dan   30   40000
2  Helen   35   60000
3  Marry   29   58000

In [17]:
df.loc[1:3]

    Name  Age  Salary
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [19]:
df.loc[[0,2],["Name","Salary"]]

    Name  Salary
0    Dan   40000
2  Helen   60000

In [21]:
df.loc[0:2,["Age"]]

   Age
0   30
1   40
2   35

In [22]:
df.loc[:,["Name","Salary"]]

    Name  Salary
0    Dan   40000
1   John   50000
2  Helen   60000
3  Marry   58000

In [23]:
df.iloc[0]

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [24]:
df.iloc[0,2]

40000

In [30]:
df.iloc[0:3,0]

0      Dan
1     John
2    Helen
Name: Name, dtype: object

In [33]:
df.iloc[[0,3],0:2]

    Name  Age
0    Dan   30
3  Marry   29

In [40]:
df.sample(1)

  Name  Age  Salary
0  Dan   30   40000

In [44]:
df.sample(frac = 0.5)

   Name  Age  Salary
1  John   40   50000
0   Dan   30   40000